; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 961548 1 2 4 4 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	image3 - mode
	image2 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image3)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star4 image2)
	(have_image Phenomenon5 image0)
	(have_image Planet6 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 star4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star4)
   goals met: 0 of 3
4. (turn_to satellite0 planet6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet6)
   goals met: 0 of 3
5. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 1 of 3
6. (turn_to satellite0 star4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star4)
   goals met: 1 of 3
7. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 3
8. (take_image satellite0 phenomenon5 instrument1 image0)
   added: (have_image phenomenon5 image0)
   goals met: 2 of 3
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 3
10. (turn_to satellite0 star4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star4)
   goals met: 2 of 3
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 3
12. (turn_to satellite0 groundstation3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 3
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 3
14. (turn_to satellite0 star4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star4)
   goals met: 2 of 3
15. (take_image satellite0 star4 instrument0 image2)
   added: (have_image star4 image2)
   goals met: 3 of 3
